const { Markup } = require("telegraf");

module.exports = (bot) => {
  // Функція для створення клавіатури "Про навчання"
  const educationMenu = Markup.keyboard([["Курси 📚", "Формати навчання 🧠"], ["Головне меню 🔙"]]).resize();
  
  const coursesMenu = Markup.keyboard([
    ["Загальний курс", "Індивідуальний курс"],
    ["Курс для початківців в записі", "Підготовка до DELE"],
    ["Назад 🔙"],
  ]).resize();

  // Обробка команди "Про навчання 📖"
  bot.hears("Про навчання 📖", (ctx) => {
    ctx.reply("Оберіть опцію для перегляду інформації про навчання:", educationMenu);
  });

  // Обробка команди "Курси 📚"
  bot.hears("Курси 📚", (ctx) => {
    ctx.reply("Оберіть курс для отримання додаткової інформації:", coursesMenu);
  });

  // Обробка команди "Формати навчання 🧠"
bot.hears("Формати навчання 🧠", (ctx) => {
  ctx.reply(`Всі наші заняття проводяться онлайн - гнучкий графік навчання та можливість вчитися з будь-якого місця, де є інтернет.

🔹 **Індивідуальне навчання:**
• Персоналізований підхід з урахуванням вашого рівня знань і цілей.
• Гнучкість у виборі темпів і графіку занять.
• Максимальна увага викладача до ваших потреб.

🔹 **Групове навчання:**
• Спілкування з однодумцями та обмін досвідом у групі.
• Мотивація через колективне навчання, де учасники підтримують одне одного.
• Оптимальний варіант для тих, хто любить працювати в команді.

🔹 **Парне навчання:**
• Навчання з другом, подругою або партнером.
• Мотивація через спільне навчання з напарником.
• Ідеально підходить для тих, кому не комфортно вчитися в групі, але не подобається працювати наодинці.`, { parse_mode: "Markdown" });

  // Створення клавіатури з кнопками
  const keyboard = Markup.keyboard([
      ["Курси 📚", "Головне меню 🔙"],
  ]).resize();

  // Відправка клавіатури користувачу
  ctx.reply("Оберіть опцію:", keyboard);
});

  // Обробка команди "Загальний курс"
  bot.hears("Загальний курс", (ctx) => {
    ctx.reply(`🎓 Загальний курс в трьох форматах:
  
  🔹 **Групове навчання**
  • Безкоштовне тестування
  • Міні-група до 6 людей
  • 80% розмовної практики, 20% теорії
  • 2 заняття на тиждень по 80 хв
  • Чат з викладачем для питань
  • Підтримка менеджера
  • Сертифікат у кінці курсу
  • Доступ до матеріалів та ресурсів безкоштовно
  
  🔹 **Парне навчання**
  • Безкоштовне тестування рівня
  • Зустріч знайомство з викладачем - безкоштовно
  • Навчання у парі: з другом, партнером або колегою
  • 70% розмовної практики, 30% теорії
  • 2 заняття на тиждень по 60 хв
  • Чат з викладачем для питань та зворотного зв'язку
  • Підтримка менеджера протягом усього курсу
  • Сертифікат після завершення курсу
  • Доступ до всіх навчальних матеріалів безкоштовно
  
  🔹 **Індивідуальне навчання**
  • Безкоштовне тестування для визначення рівня
  • Зустріч знайомство з викладачем - безкоштовно
  • Персоналізована програма, адаптована під твої цілі
  • 90% розмовної практики, 10% теорії
  • 2 заняття на тиждень по 60 хв
  • Чат з викладачем для постійної підтримки
  • Підтримка менеджера на всіх етапах навчання
  • Сертифікат про проходження курсу
  • Повний доступ до матеріалів та додаткових ресурсів безкоштовно`, { parse_mode: "Markdown" });

    // Створення клавіатури з кнопками
    const keyboard = Markup.keyboard([
      ["Ціна 💰", "Головне меню 🔙"],
      ["Курси 📚"],
    ]).resize();

    // Відправка клавіатури користувачу
    ctx.reply("Оберіть опцію:", keyboard);
  });

  // Обробка команди "Індивідуальний курс"
  bot.hears("Індивідуальний курс", (ctx) => {
    ctx.reply(`Індивідуальний курс – це спеціально розроблена програма, що відповідає твоїм унікальним потребам і цілям. Чи то підготовка до важливої співбесіди, складання іспиту з водіння чи вивчення певної сфери лексики – цей курс налаштовується саме під тебе.

Кожне заняття створене для того, щоб максимально швидко і ефективно допомогти тобі досягти результатів. Завдяки повній увазі викладача, ти зможеш фокусуватися на тому, що для тебе є найбільш актуальним. Гнучкий графік, індивідуальний підхід і практичні завдання гарантують, що ти отримаєш саме ті знання, які потрібні в реальному житті. Це ідеальний вибір для тих, хто цінує свій час і хоче досягти конкретної мети.

Чим цей курс відрізняється від загального в індивідуальному форматі❓

Індивідуальний курс під конкретний запит відрізняється від загального курсу своєю максимальною спрямованістю на конкретні цілі студента. Якщо загальний курс орієнтований на всебічний розвиток мовних навичок та охоплює базові теми, то спеціалізований курс фокусується на вузьких, практичних завданнях, як-от підготовка до співбесіди, складання іспиту чи вивчення певної професійної термінології. Такий курс не є стандартною програмою — він адаптується до потреб і графіку студента, щоб забезпечити найшвидший і найефективніший результат. Це рішення для тих, хто має конкретну мету та хоче досягти її в найкоротші терміни.`, { parse_mode: "Markdown" });

    // Створення клавіатури з кнопками
    const keyboard = Markup.keyboard([
      ["Ціна 🤑", "Головне меню 🔙"],
      ["Курси 📚"],
    ]).resize();

    // Відправка клавіатури користувачу
    ctx.reply("Оберіть опцію:", keyboard);
  });

  // Обробка команди "Курс для початківців в записі"
  bot.hears("Курс для початківців в записі", (ctx) => {
    ctx.reply("Курс для початківців містить записані уроки, які можна переглядати у зручний час.");
  });

  // Обробка команди "Підготовка до DELE"
  bot.hears("Підготовка до DELE", (ctx) => {
    ctx.reply(`Наші курси підготовки до іспиту DELE – це твій надійний шлях до успіху! 🎓

Кожен урок ретельно розроблений для того, щоб допомогти тобі не лише вивчити матеріал, але й зрозуміти формат іспиту, навички, які перевіряються, та як їх найкраще застосувати. Під час курсу ти отримаєш доступ до практичних завдань, пробних тестів, іспитів минулих років та індивідуальних порад від викладачів, які мають великий досвід підготовки до DELE.

📚 Що ти отримаєш:
• Комплексна підготовка з усіх мовних компетенцій: читання, письмо, аудіювання, говоріння.
• Індивідуальні рекомендації та поради щодо стратегії складання іспиту.
• Регулярні симуляції реальних тестів для впевненості в своїх силах.

🎯 Наші курси орієнтовані на досягнення результатів, тому ти зможеш підійти до іспиту впевнено і готово. Ми допоможемо тобі не просто скласти DELE, а пройти цей шлях із задоволенням та максимальним результатом.

Тривалість курса - 2 місяці = 16 занять.

💡 є можливість продовжити курс за необхідністю.

Наші курси підготовки до DELE доступні у двох форматах – індивідуально та в парі, щоб кожен зміг обрати найбільш комфортний для себе варіант навчання.

🔹 Індивідуальне навчання
Це формат для тих, хто прагне максимального занурення та повної уваги викладача. Ти зможеш рухатися у своєму темпі, фокусуючись на власних сильних та слабких сторонах. Усі уроки будуть персоналізовані, орієнтовані на твої цілі та потреби, що забезпечить найефективнішу підготовку до DELE. Індивідуальний формат дозволяє повністю контролювати свій процес навчання, що особливо важливо для тих, хто хоче досягти найвищих результатів у короткий термін.

🔹 Парне навчання
Навчайся з другом, партнером або однодумцем і отримуй переваги від спільного навчання! У парі ти будеш не лише вивчати матеріал, але й постійно практикувати мову в розмові з партнером, що значно прискорить розвиток мовних навичок. Парне навчання створює додаткову мотивацію, адже ви підтримуєте одне одного і допомагаєте разом долати труднощі. Це ідеальний варіант для тих, хто цінує командну роботу, але хоче зберегти індивідуальний підхід до підготовки.

Для більш детальної консультації ви можете зв’язатися з адміністратором за посиланням [@espacioescuela](http://t.me/espacioescuela). Із радістю відповімо на всі Ваші запитання🥰`, { parse_mode: "Markdown" });

    // Створення клавіатури з кнопками
    const keyboard = Markup.keyboard([
      ["Курси 📚", "Головне меню 🔙"],
    ]).resize();

    // Відправка клавіатури користувачу
    ctx.reply("Оберіть опцію:", keyboard);
  });

  // Обробка команди "Назад 🔙"
  bot.hears("Назад 🔙", (ctx) => {
    ctx.reply("Ви повернулися до попереднього меню:", educationMenu);
  });
  bot.hears("Ціна 🤑", (ctx) => {
    ctx.reply(`💻 **Онлайн:**
    
• 8 занять

• 800 грн / заняття

• Загальна ціна: 6400 грн

🔔 Ціна вказана для рівнів 0 - B1. Рівні від B2 (≈) + 10% від вартості.

Для більш детальної консультації ви можете зв’язатися з адміністратором за посиланням [@espacioescuela](http://t.me/espacioescuela). Із радістю відповімо на всі Ваші запитання🥰`, { parse_mode: "Markdown" });
});


  // Обробка команди "Ціна 💰" для загального курсу
  bot.hears("Ціна 💰", (ctx) => {
    ctx.reply(`💻 **Групове:**
• 8 занять
• 450 грн / заняття
• Загальна ціна: 3600 грн
💻 **Парне:**
• 8 занять
• 580 грн / заняття
• Загальна ціна: 4640 грн

💻 **Індивідуально:**
• 8 занять
• 800 грн / заняття
• Загальна ціна: 6400 грн

🔔 Ціна вказана для рівнів 0 - B1. Рівні від B2 (≈) + 10% від вартості.

Для більш детальної консультації ви можете зв’язатися з адміністратором за посиланням [@espacioescuela](http://t.me/espacioescuela). Із радістю відповімо на всі Ваші запитання.`, { parse_mode: "Markdown" });


      
    // Створення клавіатури з кнопками
    const keyboard = Markup.keyboard([
      ["Головне меню 🔙"],
      ["Курси 📚"],
    ]).resize();

    ctx.reply("Оберіть опцію:", keyboard);
  });
};
