const { Markup } = require("telegraf");

module.exports = (bot) => {
  const mainMenuKeyboard = Markup.keyboard([
    ["Про школу 🏫", "Про навчання 📖"],
    ["Дізнатися свій рівень 📊"],
    ["Наші викладачі 👩‍🏫", "Отримати бонус 🎁"],
    ["Хочу навчатись 👨‍🎓", "Написати адміністратору 📨"],
    ["Наші контакти 📞"],
  ]).resize();

  const schoolSubMenuKeyboard = Markup.keyboard([["Часті питання ❓", "Чому ми ❓"], ["Головне меню 🔙"]]).resize();

  bot.start((ctx) => {
    ctx.reply(
      "👋 Вітаємо в нашій школі іспанської мови! 🎉 Тут ти знайдеш усе необхідне, щоб вивчати цю прекрасну мову весело та ефективно.",
      mainMenuKeyboard
    );
  });

  bot.hears("Про школу 🏫", (ctx) => {
    ctx.reply(
      "👋 Biendenidos a nuestro ESPAcio 🪐\n\n" +
        "Ми – не просто школа, а місце, де ти зможеш розкрити свій потенціал, занурившись у світ мови і культури. " +
        "Для нас важливо, щоб кожен урок ставав кроком вперед на шляху до самореалізації та нових відкриттів. " +
        "Тут ти будеш відчувати підтримку і натхнення у кожній дії.\n\n" +
        "✨ Іспанська мова для нас – це ключ до нових можливостей, інструмент для особистісного зростання і розширення горизонтів. " +
        "Ми пропонуємо уроки, що легко інтегруються у твоє активне життя, допомагаючи тобі впевнено рухатися до нових вершин.",
      schoolSubMenuKeyboard // переключение на клавиатуру подменю
    );
  });

  bot.hears("Часті питання ❓", (ctx) => {
    ctx.reply(
      "❓ **Які формати занять ви пропонуєте?**\n" +
        "Ми пропонуємо як класичні 🖥️ онлайн заняття (індивідуальні, парні та групові), так і асинхронний формати навчання, " +
        "де учні мають змогу навчатися будь-де та в будь-який час.\n\n" +
        "❓ **Які рівні володіння іспанською мовою пропонуються на курсах?**\n" +
        "Ми маємо курси для всіх рівнів: від 0 початкового до С1. Також маємо курси по підготовці екзамену DELE.\n\n" +
        "❓ **Як організовані парні заняття?**\n" +
        "Більшість наших студентів вже приходять з парою (подружкою 👭, хлопцем 👫🏼, тощо). Але ми також можемо підшукати вам підходящу за рівнем пару 👩‍🏫.\n\n" +
        "❓ **Як організовані групи?**\n" +
        "Наші групи зазвичай складаються з 4-6 учасників, що гарантує 📚 ефективну комунікацію та 👩‍🏫 індивідуальний підхід.\n\n" +
        "❓ **Як часто проводяться заняття?**\n" +
        "Стандартно заняття проводяться 2 рази на тиждень 📅, але це може варіюватися в залежності від обраного курсу та бажаного розкладу.\n\n" +
        "❓ **Що буде, якщо я пропущу урок в парі чи групі?**\n" +
        "Парні уроки можна переносити за 24 години (якщо всім підходить) та відпрацювати в інший день за узгодженням усіх учасників та викладача. " +
        "Якщо перенести та відпрацювати не вдається, учень, який не може бути присутнім на уроці, отримає відеозапис заняття. " +
        "В групі заняття не преносяться. В разі відсутності з будь-яких причин учень отримує відеозапис уроку. " +
        "Таким чином учень не пропустить жодного матеріалу.\n\n" +
        "❓ **Чи потрібно мати попередні знання іспанської для запису?**\n" +
        "Наші курси відкриті для всіх 🏁! Ми пропонуємо 📊 тестування рівня перед початком навчання, щоб допомогти вам знайти найкращий курс.\n\n" +
        "❓ **Які методи навчання використовуються?**\n" +
        "Ми використовуємо 📖 комунікативний метод, інтерактивні завдання та автентичні матеріали для максимального занурення у мову.\n\n" +
        "❓ **Які часові обмеження для запису на курси?**\n" +
        "Ми приймаємо заявки цілий рік ⏳, але радимо записуватися заздалегідь, оскільки місця можуть бути обмежені." +
        "Не знайшли потрібну відповіді? Із радістю відповімо на всі Ваші запитання🥰 - @espacioescuela",
      schoolSubMenuKeyboard
    );
  });

  bot.hears("Чому ми ❓", (ctx) => {
    ctx.reply(
      "🔹 **Персоналізований підхід**\n" +
        "Ми пропонуємо курси, адаптовані до потреб, цілей та рівня кожного студента. " +
        "Кожен наш курс має чіткий план, який ми змінюємо під темп та вподобання кожної окремої групи. " +
        "Це дозволяє ефективно просуватися у вивченні мови і досягати результатів швидше.\n\n" +
        "🔹 **Професійні викладачі**\n" +
        "Наші викладачі – це експерти з досвідом викладання іспанської мови. " +
        "Вони створюють атмосферу, де навчання стає приємним і цікавим процесом. " +
        'Кожен різний та індивідуальний. Ти точно знайдеш тут "свого profe".\n\n' +
        "🔹 **Гнучкий графік занять**\n" +
        "Ти можеш обирати час, що найбільше підходить твоєму графіку. " +
        "Ми пропонуємо варіанти, які легко поєднати з роботою чи особистими справами.\n\n" +
        "🔹 **Сучасні методики**\n" +
        "Ми використовуємо інтерактивні ресурси (Miro, Quizlet, Wordwall тощо), які не тільки допомагають розвивати всі мовні навички: " +
        "від розуміння на слух до вільної комунікації, але і роблять цей процес неймовірно цікавим.\n\n" +
        "🔹 **Доступність для кожного**\n" +
        "Наші ціни розроблені таким чином, щоб курси були доступними для всіх. " +
        "Крім того, оплата відбувається не за весь курс, а помісячно.\n\n" +
        "🔹 **Онлайн-матеріали**\n" +
        "Отримуй доступ до додаткових ресурсів, таких як відеоуроки, вправи та інтерактивні завдання, " +
        "які допоможуть тобі швидше досягти своїх цілей.\n\n" +
        "🔹 **Служба підтримки**\n" +
        "Ми завжди готові допомогти тобі з будь-якими питаннями щодо навчання чи технічної підтримки. " +
        "Ти завжди можеш розраховувати на нас!",
      schoolSubMenuKeyboard 
    );
  });

  bot.hears("Головне меню 🔙", (ctx) => {
    ctx.reply(
      "Ви повернулися в головне меню. Оберіть опцію:",
      mainMenuKeyboard 
    );
  });
};


