// Обработка кнопки "Menu" для возврата в главное меню
//   bot.hears("Menu", (ctx) => {
//     ctx.reply("Ви повернулися в головне меню. Оберіть опцію:", mainMenu());
//   });
// };

const { Markup } = require("telegraf");

function mainMenu() {
  return Markup.keyboard([
    ["Про школу 🏫", "Про навчання 📖"],
    ["Дізнатися свій рівень 📊"],
    ["Наші викладачі 👩‍🏫", "Отримати бонус 🎁"],
    ["Хочу навчатись 👨‍🎓", "Зв´язатися з менеджером 📨"],
    ["Наші контакти 📞"],
  ]).resize();
}

module.exports = mainMenu; // Экспортируем mainMenu как функцию
