module.exports = (bot) => {
  // Обработка выбора "Тест 📝"
  bot.hears("Дізнатися свій рівень 📊", (ctx) => {
    ctx.reply(
      "Оберіть тест для визначення свого рівня:\n1. Тест на рівень A1\n2. Тест на рівень A2\n3. Тест на рівень B1"
    );
  });

  // Здесь вы можете добавить дополнительные обработчики для конкретных тестов
  bot.hears("Тест на рівень A1", (ctx) => {
    ctx.reply("Вы выбрали тест на уровень A1. Начнем!");
    // Логика для теста A1
  });

  bot.hears("Тест на рівень A2", (ctx) => {
    ctx.reply("Вы выбрали тест на уровень A2. Начнем!");
    // Логика для теста A2
  });

  bot.hears("Тест на рівень B1", (ctx) => {
    ctx.reply("Вы выбрали тест на уровень B1. Начнем!");
    // Логика для теста B1
  });
};
